app/controllers/sessions_controller.rb

  def create
    #User.find_by(id: session[:user_id])
    user = User.find_by(email: params[:session][:email].downcase)
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "test@test.fr"], ["LIMIT", 1]]